{
  "_name_or_path": "./bert-base-local-results",
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "classifier_dropout": null,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "rating",
    "1": "type",
    "2": "years in business",
    "3": "service options",
    "4": "hours",
    "5": "reviews",
    "6": "address",
    "7": "description",
    "8": "price",
    "9": "button text",
    "10": "phone"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "address": 6,
    "button text": 9,
    "description": 7,
    "hours": 4,
    "phone": 10,
    "price": 8,
    "rating": 0,
    "reviews": 5,
    "service options": 3,
    "type": 1,
    "years in business": 2
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 512,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 12,
  "pad_token_id": 0,
  "position_embedding_type": "absolute",
  "problem_type": "multi_label_classification",
  "torch_dtype": "float32",
  "transformers_version": "4.24.0",
  "type_vocab_size": 2,
  "use_cache": true,
  "vocab_size": 30522
}
